In [ ]:
import numpy as np

In [ ]:
import pandas as pd

In [ ]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
   .....:                    "data1": range(6)})

In [ ]:
df

In [ ]:
pd.get_dummies(df["key"])

In [ ]:
dummies = pd.get_dummies(df["key"], prefix="key")

In [ ]:
dummies

In [ ]:
df_with_dummy = df[["data1"]].join(dummies)

In [ ]:
df_with_dummy

In [ ]:
mnames = ["movie_id", "title", "genres"]

In [ ]:
mnames

In [ ]:
movies = pd.read_table("datasets/movielens/movies.dat", sep="::",
   .....:                        header=None, names=mnames, engine="python")

In [ ]:
movies

In [ ]:
movies.head()

In [ ]:
dummies = movies["genres"].str.get_dummies("|")

In [ ]:
dummies.iloc[:10,:6]

In [ ]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))

In [ ]:
movies_windic.iloc[0]

In [ ]:
s = pd.Series([1, 2, 3, None])

In [ ]:
s

In [ ]:
import re

In [ ]:
text = "foo    bar\t baz  \tqux"

In [ ]:
re.split(r"\s+", text)

In [ ]:
text

In [ ]:
data = pd.Series(np.random.uniform(size=9),
   ....:                  index=[["a", "a", "a", "b", "b", "c", "c", "d", "d"],
   ....:                         [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [ ]:
data

In [ ]:
data["b"]

In [ ]:
data.loc[["b", "d"]]

In [ ]:
data.loc[:, 2]

In [ ]:
data = pd.read_csv("examples/macrodata.csv")

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
data = pd.read_csv("examples/macrodata.csv")

In [ ]:
data=data.loc[:, ["year", "quarter", "realgdp", "infl", "unemp"]]

In [ ]:
data.head()

In [ ]:
periods = pd.PeriodIndex(year=data.pop("year"),
   .....:                          quarter=data.pop("quarter"),
   .....:                          name="date")

In [ ]:
periods

In [ ]:
data.index = periods.to_timestamp("D")

In [ ]:
data.head()

In [ ]:
data = data.reindex(columns=["realgdp", "infl", "unemp"])

In [ ]:
data.columns.name = "item"

In [ ]:
data.head()

In [ ]:
long_data = (data.stack()
   .....:              .reset_index()
   .....:              .rename(columns={0: "value"}))

In [ ]:
long_data[:10]

In [ ]:
pivoted = long_data.pivot(index="date", columns="item",
   .....:                           values="value")

In [ ]:
pivoted.head()

In [ ]:
long_data["value2"] = np.random.standard_normal(len(long_data))

In [ ]:
long_data[:10]

In [ ]:
pivoted = long_data.pivot(index="date", columns="item")

In [ ]:
pivoted.head()

In [ ]:
pivoted["value"].head()

In [ ]:
df = pd.DataFrame({"key": ["foo", "bar", "baz"],
   .....:                    "A": [1, 2, 3],
   .....:                    "B": [4, 5, 6],
   .....:                    "C": [7, 8, 9]})

In [ ]:
df

In [ ]:
melted = pd.melt(df, id_vars="key")

In [ ]:
melted

In [ ]:
reshaped = melted.pivot(index="key", columns="variable",
   .....:                         values="value")

In [ ]:
reshaped

In [ ]:
reshaped.reset_index()

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
data = np.arange(10)

In [ ]:
data

In [ ]:
plt.plot(data)

In [ ]:
%matplotlib inline

In [ ]:
plt.plot(data)

In [ ]:
fig=plt.figure()

In [ ]:
ax1 = fig.add_subplot(2, 2, 1)

In [ ]:
ax1

In [ ]:
ax2 = fig.add_subplot(2, 2, 2)

In [ ]:
ax3 = fig.add_subplot(2, 2, 3)

In [ ]:
fig = plt.figure()
ax1 = fig.add_subplot(2, 2, 1)
ax2 = fig.add_subplot(2, 2, 2)
ax3 = fig.add_subplot(2, 2, 3)

In [ ]:
ax3.plot(np.random.standard_normal(50).cumsum(), color="black",
   ....:          linestyle="dashed")

In [ ]:
ax3

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [ ]:
data = np.arange(10)

In [ ]:
plt.plot(data)

In [ ]:
ax3 = fig.add_subplot(2, 2, 3)

In [ ]:
fig = plt.figure()

In [ ]:
ax1 = fig.add_subplot(2, 2, 1)

In [ ]:
ax2 = fig.add_subplot(2, 2, 2)

In [ ]:
fig = plt.figure()
ax1 = fig.add_subplot(2, 2, 1)
ax2 = fig.add_subplot(2, 2, 2)
ax3 = fig.add_subplot(2, 2, 3)

In [ ]:
ax3.plot(np.random.standard_normal(50).cumsum(), color="black",
   ....:          linestyle="dashed")

In [ ]:
fig=plt.figure()
ax3.plot(np.random.standard_normal(50).cumsum(), color="black", linestyle="dashed")

In [ ]:
ax1.hist(np.random.standard_normal(100), bins=20, color="black", alpha=0
.3);

In [ ]:
ax1.hist(np.random.standard_normal(100), bins=20, color="black", alpha=0
.3);

In [ ]:
ax1.hist(np.random.standard_normal(100), bins=20, color="black", alpha=0.3)

In [ ]:
plt.show()

In [ ]:
ax2.scatter(np.arange(30), np.arange(30) + 3 * np.random.standard_normal
(30));
plt.show()

In [ ]:
ax1.hist(np.random.standard_normal(100), bins=20, color="black", alpha=0.3);

In [ ]:
ax3.plot(np.random.standard_normal(50).cumsum(), color="black", linestyle="dashed")

In [ ]:
fig = plt.figure()
ax1 = fig.add_subplot(2, 2, 1)
ax2 = fig.add_subplot(2, 2, 2)
ax3 = fig.add_subplot(2, 2, 3)

In [ ]:
fig, axes = plt.subplots(2, 3)

In [3]:
df = pd.DataFrame({"key1" : ["a", "a", None, "b", "b", "a", None], "key2" : pd.Series([1, 2, 1, 2, 1, None, 1], dtype="Int64"), "data1" : np.random.standard_normal(7),"data2" : np.random.standard_normal(7)})

In [4]:
df

   key1  key2     data1     data2
0     a     1 -2.585837 -0.943541
1     a     2  1.178403  2.166137
2  None     1 -0.211890 -0.258932
3     b     2 -0.684666  0.183030
4     b     1  1.148302 -1.911330
5     a  <NA>  0.308560 -0.933289
6  None     1 -0.119634  1.702204

In [24]:
df.groupby(df['key2']).mean()

         data1     data2
key2
1    -0.442265 -0.352900
2     0.246868  1.174583

In [6]:
grouped

In [7]:
grouped.mean()

key1
a   -0.366291
b    0.231818
Name: data1, dtype: float64

In [8]:
means = df["data1"].groupby([df["key1"], df["key2"]]).mean()

In [9]:
means

key1  key2
a     1      -2.585837
      2       1.178403
b     1       1.148302
      2      -0.684666
Name: data1, dtype: float64

In [10]:
means.unstack()

key2         1         2
key1
a    -2.585837  1.178403
b     1.148302 -0.684666

In [11]:
a=means.unstack()

In [12]:
a

key2         1         2
key1
a    -2.585837  1.178403
b     1.148302 -0.684666

In [13]:
a.stack()

key1  key2
a     1      -2.585837
      2       1.178403
b     1       1.148302
      2      -0.684666
dtype: float64

In [14]:
states = np.array(["OH", "CA", "CA", "OH", "OH", "CA", "OH"])

In [15]:
years = [2005, 2005, 2006, 2005, 2006, 2005, 2006]

In [17]:
df["data1"].groupby([states, years]).mean()

CA  2005    0.743482
    2006   -0.211890
OH  2005   -1.635252
    2006    0.514334
Name: data1, dtype: float64

In [18]:
states

array(['OH', 'CA', 'CA', 'OH', 'OH', 'CA', 'OH'], dtype='<U2')

In [19]:
years

[2005, 2005, 2006, 2005, 2006, 2005, 2006]

In [20]:
df

   key1  key2     data1     data2
0     a     1 -2.585837 -0.943541
1     a     2  1.178403  2.166137
2  None     1 -0.211890 -0.258932
3     b     2 -0.684666  0.183030
4     b     1  1.148302 -1.911330
5     a  <NA>  0.308560 -0.933289
6  None     1 -0.119634  1.702204

In [25]:
df

   key1  key2     data1     data2
0     a     1 -2.585837 -0.943541
1     a     2  1.178403  2.166137
2  None     1 -0.211890 -0.258932
3     b     2 -0.684666  0.183030
4     b     1  1.148302 -1.911330
5     a  <NA>  0.308560 -0.933289
6  None     1 -0.119634  1.702204

In [30]:
df.groupby(["key1", "key2"], dropna=False).size()

key1  key2
a     1       1
      2       1
      <NA>    1
b     1       1
      2       1
NaN   1       2
dtype: int64

In [34]:
df.groupby("key1", dropna=False).count()

      key2  data1  data2
key1
a        2      3      3
b        2      2      2
NaN      2      2      2

In [32]:
df.groupby("key1").size()

key1
a    3
b    2
dtype: int64

In [33]:
df

   key1  key2     data1     data2
0     a     1 -2.585837 -0.943541
1     a     2  1.178403  2.166137
2  None     1 -0.211890 -0.258932
3     b     2 -0.684666  0.183030
4     b     1  1.148302 -1.911330
5     a  <NA>  0.308560 -0.933289
6  None     1 -0.119634  1.702204

In [35]:
for name, group in df.groupby("key1"):
   ....:     print(name)
   ....:     print(group)

a
  key1  key2     data1     data2
0    a     1 -2.585837 -0.943541
1    a     2  1.178403  2.166137
5    a  <NA>  0.308560 -0.933289
b
  key1  key2     data1    data2
3    b     2 -0.684666  0.18303
4    b     1  1.148302 -1.91133

In [36]:
for (k1, k2), group in df.groupby(["key1", "key2"]):
   ....:     print((k1, k2))
   ....:     print(group)

('a', 1)
  key1  key2     data1     data2
0    a     1 -2.585837 -0.943541
('a', 2)
  key1  key2     data1     data2
1    a     2  1.178403  2.166137
('b', 1)
  key1  key2     data1    data2
4    b     1  1.148302 -1.91133
('b', 2)
  key1  key2     data1    data2
3    b     2 -0.684666  0.18303

In [37]:
pieces = {name: group for name, group in df.groupby("key1")}

In [38]:
pieces["b"]

  key1  key2     data1    data2
3    b     2 -0.684666  0.18303
4    b     1  1.148302 -1.91133

In [42]:
df.groupby(["key1", "key2"]).mean()

              data1     data2
key1 key2
a    1    -2.585837 -0.943541
     2     1.178403  2.166137
b    1     1.148302 -1.911330
     2    -0.684666  0.183030

In [43]:
s_grouped = df.groupby(["key1", "key2"])["data2"]

In [44]:
s_grouped

In [45]:
s_grouped.mean()

key1  key2
a     1      -0.943541
      2       2.166137
b     1      -1.911330
      2       0.183030
Name: data2, dtype: float64

In [46]:
people = pd.DataFrame(np.random.standard_normal((5, 5)),
   ....:                       columns=["a", "b", "c", "d", "e"],
   ....:                       index=["Joe", "Steve", "Wanda", "Jill", "Trey"])

In [47]:
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values

In [48]:
people

              a         b         c         d         e
Joe   -0.729746 -1.198536  1.114630 -0.231900 -0.183975
Steve -0.015363 -0.833040  0.620772  0.819499  0.418193
Wanda  2.100278       NaN       NaN -0.158779 -1.563559
Jill  -0.671134 -0.744232 -2.106182 -0.102476  0.614857
Trey  -0.966497 -1.563191  0.920112  0.433244 -1.163974

In [49]:
mapping = {"a": "red", "b": "red", "c": "blue",
   ....:            "d": "blue", "e": "red", "f" : "orange"}

In [51]:
by_column = people.groupby(mapping, axis="columns")

In [53]:
by_column.sum()

           blue       red
Joe    0.882730 -2.112257
Steve  1.440271 -0.430210
Wanda -0.158779  0.536719
Jill  -2.208658 -0.800509
Trey   1.353356 -3.693662

In [54]:
-0.966497-1.563191-1.163974

-3.6936620000000002

In [55]:
map_series = pd.Series(mapping)

In [56]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [58]:
people.groupby(map_series, axis="columns").count()

       blue  red
Joe       2    3
Steve     2    3
Wanda     1    2
Jill      2    3
Trey      2    3

In [59]:
people

              a         b         c         d         e
Joe   -0.729746 -1.198536  1.114630 -0.231900 -0.183975
Steve -0.015363 -0.833040  0.620772  0.819499  0.418193
Wanda  2.100278       NaN       NaN -0.158779 -1.563559
Jill  -0.671134 -0.744232 -2.106182 -0.102476  0.614857
Trey  -0.966497 -1.563191  0.920112  0.433244 -1.163974

In [61]:
people.groupby(len, axis = "columns").sum()

              1
Joe   -1.229527
Steve  1.010060
Wanda  0.377940
Jill  -3.009166
Trey  -2.340306

In [62]:
key_list = ["one", "one", "one", "two", "two"]

In [63]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.729746 -1.198536  1.114630 -0.231900 -0.183975
4 two -0.966497 -1.563191 -2.106182 -0.102476 -1.163974
5 one -0.015363 -0.833040  0.620772 -0.158779 -1.563559

In [64]:
people.groupby(len).min()

          a         b         c         d         e
3 -0.729746 -1.198536  1.114630 -0.231900 -0.183975
4 -0.966497 -1.563191 -2.106182 -0.102476 -1.163974
5 -0.015363 -0.833040  0.620772 -0.158779 -1.563559

In [65]:
columns = pd.MultiIndex.from_arrays([["US", "US", "US", "JP", "JP"],
   ....:                                     [1, 3, 5, 1, 3]],
   ....:                                     names=["cty", "tenor"])

In [67]:
hier_df = pd.DataFrame(np.random.standard_normal((4, 5)), columns=columns)

In [68]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.208210  0.698444  0.580059  0.452121 -1.325555
1     -0.676308  0.993170 -1.088594 -0.432367  0.127792
2     -0.095367 -0.732515  0.358636 -0.204835 -0.019953
3     -0.211628  0.147785  1.109033  0.890922  0.422064

In [69]:
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [70]:
hier_df.groupby(level="cty", axis="columns").count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3